In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([9, 2 ,-7, 1])

In [3]:
obj

0    9
1    2
2   -7
3    1
dtype: int64

In [4]:
obj.values

array([ 9,  2, -7,  1], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([9,2,3,2], index=['a','b','c','d'])

In [7]:
obj2

a    9
b    2
c    3
d    2
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj2['c']

3

In [10]:
obj2['a'] = 100

In [11]:
obj2

a    100
b      2
c      3
d      2
dtype: int64

In [12]:
obj2[['b','d']]

b    2
d    2
dtype: int64

In [13]:
obj2[obj2 > 5]

a    100
dtype: int64

In [14]:
obj2 * 2

a    200
b      4
c      6
d      4
dtype: int64

In [15]:
np.exp(obj2)

a    2.688117e+43
b    7.389056e+00
c    2.008554e+01
d    7.389056e+00
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
's' in obj2

False

In [18]:
sdata = {'Solo':12000,'Cirebon':9000,'Jakarta':14000,'Bandung':5000}
obj3 = pd.Series(sdata)
obj3

Solo       12000
Cirebon     9000
Jakarta    14000
Bandung     5000
dtype: int64

In [19]:
states = ['Jabar','Cirebon','Jakarta','Bandung']
obj4 = pd.Series(sdata, index=states)
obj4

Jabar          NaN
Cirebon     9000.0
Jakarta    14000.0
Bandung     5000.0
dtype: float64

In [20]:
pd.isnull(obj4)

Jabar       True
Cirebon    False
Jakarta    False
Bandung    False
dtype: bool

In [21]:
obj4.isnull()

Jabar       True
Cirebon    False
Jakarta    False
Bandung    False
dtype: bool

In [22]:
obj3

Solo       12000
Cirebon     9000
Jakarta    14000
Bandung     5000
dtype: int64

In [23]:
obj3 + obj4

Bandung    10000.0
Cirebon    18000.0
Jabar          NaN
Jakarta    28000.0
Solo           NaN
dtype: float64

In [24]:
obj4.name = 'populasi'
obj4.index.name = 'propinsi'
obj4

propinsi
Jabar          NaN
Cirebon     9000.0
Jakarta    14000.0
Bandung     5000.0
Name: populasi, dtype: float64

In [25]:
obj

0    9
1    2
2   -7
3    1
dtype: int64

In [26]:
obj.index = ['Den','Ndah','Anza','Yun']
obj

Den     9
Ndah    2
Anza   -7
Yun     1
dtype: int64

In [27]:
data = {'propinsi' : ['Jabar', 'Jabar', 'Jabar', 'Jatim', 'Jatim', 'Jatim'],
       'tahun' : [2000, 2001, 2002, 2001, 2002, 2003],
       'populasi' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [28]:
frame = pd.DataFrame(data)
frame

  propinsi  tahun  populasi
0    Jabar   2000       1.5
1    Jabar   2001       1.7
2    Jabar   2002       3.6
3    Jatim   2001       2.4
4    Jatim   2002       2.9
5    Jatim   2003       3.2

In [29]:
# reorder column
pd.DataFrame(data, columns=['tahun','propinsi','populasi'])

   tahun propinsi  populasi
0   2000    Jabar       1.5
1   2001    Jabar       1.7
2   2002    Jabar       3.6
3   2001    Jatim       2.4
4   2002    Jatim       2.9
5   2003    Jatim       3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['tahun', 'propinsi', 'populasi', 'hutang'],
                     index=['satu', 'dua', 'tiga', 'empat', 'lima', 'enam'])

In [31]:
frame2

       tahun propinsi  populasi hutang
satu    2000    Jabar       1.5    NaN
dua     2001    Jabar       1.7    NaN
tiga    2002    Jabar       3.6    NaN
empat   2001    Jatim       2.4    NaN
lima    2002    Jatim       2.9    NaN
enam    2003    Jatim       3.2    NaN

In [32]:
frame2.columns

Index(['tahun', 'propinsi', 'populasi', 'hutang'], dtype='object')

In [33]:
frame2['propinsi']

satu     Jabar
dua      Jabar
tiga     Jabar
empat    Jatim
lima     Jatim
enam     Jatim
Name: propinsi, dtype: object

In [34]:
frame2.tahun

satu     2000
dua      2001
tiga     2002
empat    2001
lima     2002
enam     2003
Name: tahun, dtype: int64

In [35]:
frame2.populasi

satu     1.5
dua      1.7
tiga     3.6
empat    2.4
lima     2.9
enam     3.2
Name: populasi, dtype: float64

In [36]:
# loc
frame2.loc['tiga']

tahun        2002
propinsi    Jabar
populasi      3.6
hutang        NaN
Name: tiga, dtype: object

In [37]:
# modified column by scalar
frame2

       tahun propinsi  populasi hutang
satu    2000    Jabar       1.5    NaN
dua     2001    Jabar       1.7    NaN
tiga    2002    Jabar       3.6    NaN
empat   2001    Jatim       2.4    NaN
lima    2002    Jatim       2.9    NaN
enam    2003    Jatim       3.2    NaN

In [38]:
frame2['hutang'] = 12.9
frame2

       tahun propinsi  populasi  hutang
satu    2000    Jabar       1.5    12.9
dua     2001    Jabar       1.7    12.9
tiga    2002    Jabar       3.6    12.9
empat   2001    Jatim       2.4    12.9
lima    2002    Jatim       2.9    12.9
enam    2003    Jatim       3.2    12.9

In [41]:
# or modified by array
frame2['hutang'] = np.arange(6.)
frame2

       tahun propinsi  populasi  hutang
satu    2000    Jabar       1.5     0.0
dua     2001    Jabar       1.7     1.0
tiga    2002    Jabar       3.6     2.0
empat   2001    Jatim       2.4     3.0
lima    2002    Jatim       2.9     4.0
enam    2003    Jatim       3.2     5.0

In [42]:
# try assigning list/array that not match the df length
val = pd.Series([-1.3,-2.8,-1.7], index=['dua','tiga','lima'])

In [43]:
frame2['hutang'] = val

In [44]:
frame2

       tahun propinsi  populasi  hutang
satu    2000    Jabar       1.5     NaN
dua     2001    Jabar       1.7    -1.3
tiga    2002    Jabar       3.6    -2.8
empat   2001    Jatim       2.4     NaN
lima    2002    Jatim       2.9    -1.7
enam    2003    Jatim       3.2     NaN

In [48]:
# example delete column
frame2['barat'] = frame2['propinsi'] == 'Jabar'

In [49]:
frame2

       tahun propinsi  populasi  hutang  barat
satu    2000    Jabar       1.5     NaN   True
dua     2001    Jabar       1.7    -1.3   True
tiga    2002    Jabar       3.6    -2.8   True
empat   2001    Jatim       2.4     NaN  False
lima    2002    Jatim       2.9    -1.7  False
enam    2003    Jatim       3.2     NaN  False

In [50]:
del frame2['barat']
frame2

       tahun propinsi  populasi  hutang
satu    2000    Jabar       1.5     NaN
dua     2001    Jabar       1.7    -1.3
tiga    2002    Jabar       3.6    -2.8
empat   2001    Jatim       2.4     NaN
lima    2002    Jatim       2.9    -1.7
enam    2003    Jatim       3.2     NaN